# NetworkCanNotDeterminCriticalPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkCanNotDeterminCriticalPath Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkCanNotDeterminCriticalPath { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkCanNotDeterminCriticalPath As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkCanNotDeterminCriticalPath {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace